[
  {
    "title": "Geyser",
    "date": "2020-04-04",
    "active": true,
    "github": "https://github.com/GeyserMC/Geyser",
    "img": "geyser.png",
    "description": "Geyser is a proxy, bridging the gap between Minecraft: Bedrock Edition and Minecraft: Java Edition servers. The ultimate goal of this project is to allow Minecraft: Bedrock Edition users to join Minecraft: Java Edition servers as seamlessly as possible. I've worked on various features of this software along with other tools used as part of the project, most notably GeyserConnect which combines the power of Geyser with the ease of use of BedrockConnect."
  },
  {
    "title": "Clown Carnival Carnage",
    "date": "2024-01-31",
    "github": "https://github.com/nu-game-dev-society/GGJ2024",
    "img": "clown.png",
    "description": "Can you escape the dingy carnival before the clown gets you. Complete minigames to collect tickets to pay off your debt. This game was built for GGJ 2024 with the theme Roots."
  },
  {
    "title": "rootZ",
    "date": "2023-01-31",
    "github": "https://github.com/nu-game-dev-society/GGJ2023",
    "img": "rootz.png",
    "description": "Defend your parents home from the invading roots and their minions. This game was built for GGJ 2023 with the theme Roots."
  },
  {
    "title": "Jekyll",
    "date": "2022-01-31",
    "github": "https://github.com/nu-game-dev-society/GGJ2022",
    "img": "jekyll.png",
    "description": "Step into the laboratory of Dr. Jekyll and concoct a cure to keep Mr Hyde at bay. This game was built for GGJ 2022 with the theme Duality."
  },
  {
    "title": "Lost in the Three Seas",
    "date": "2021-01-31",
    "github": "https://github.com/nu-game-dev-society/GGJ2021",
    "img": "lostseas.png",
    "description": "You're lost on the ocean, battle other fleets to increase your armada and hopefully escape. This game was built for GGJ 2021 with the theme Lost & Found."
  },
  {
    "title": "The Broken Arms",
    "date": "2020-01-31",
    "github": "https://github.com/nu-game-dev-society/GGJ2020",
    "img": "the-broken-arms.png",
    "description": "You are running a bar dealing with frantic customers while everything seems to keep breaking. Pick up the right tools to fix the problems, serve the customers what they want before it costs you money. This game was built for GGJ 2020 with the theme Repair."
  },
  {
    "title": "Data Collection and Management System",
    "date": "2020-01-14",
    "img": "data-mgmt.png",
    "description": "This management system allows for automated collection, management, sorting and a few other functions based on the collected data for a business. It uses public data sites but collates it all in one handy interface."
  },
  {
    "title": "Old website",
    "date": "2019-03-06",
    "img": "website.jpg",
    "description": "This site was built in Laravel and has various back-end features, these being expand on a regular basis. These features include APIs to manage software licencing and an admin back-end."
  },
  {
    "title": "Caravan Carnage Club",
    "date": "2019-01-31",
    "github": "https://github.com/nu-game-dev-society/CaravanCarnageClub",
    "img": "ccc.png",
    "description": "Cause carnage at your local caravan club! The best home is one stolen from an old couple on a caravan site, it's the British way! Go around and collect other caravans by crashing into the enemy cars. Collecting a caravan will give you another 10s on the clock. Losing a caravan takes of 2s from the timer. The longer you stay alive the more points you can earn and having more caravans, upto a maximum of 10, will allow you to gain points faster. This game was built for GGJ 2019 with the theme Home."
  },
  {
    "title": "YouTube Downloader",
    "date": "2019-01-17",
    "github": "https://github.com/rtm516/SimpleYoutubeDownloader",
    "img": "yt-dl.jpg",
    "description": "A simple Node.js application that allows you to convert YouTube videos to MP3. It can be used at https://simple-ytdl.glitch.me/"
  },
  {
    "title": "Garry's Mod: Capture point system",
    "date": "2019-01-08",
    "img": "cap-system.png",
    "description": "This capture point system was developed over a month and a half for GameSerbs community. It includes default captures, spawning at points, health regeneration while on points, claiming points and an overview map."
  },
  {
    "title": "CVGS Discord Bot",
    "date": "2018-10-29",
    "github": "https://github.com/rtm516/CVGSDiscordBot",
    "img": "cvgs-bot.jpg",
    "description": "This is a simple Discord bot created for Northumbria Computer and Video Games Society."
  },
  {
    "title": "YouTube Jukebox",
    "date": "2017-02-01",
    "github": "https://github.com/rtm516/YoutubeJukebox",
    "img": "yt-jb.png",
    "description": "Provides a simple way of implementing a jukebox using Node.js and YouTube."
  },
  {
    "title": "Computer bookings",
    "date": "2016-12-14",
    "img": "comp-book.png",
    "description": "This is web app I created for Northallerton School to easily manage computer rooms bookings, using Node.js."
  },
  {
    "title": "Garry's Mod: Fortwars Remastered",
    "date": "2016-06-18",
    "img": "fortwars.jpg",
    "description": "Fortwars: Remastered is a Garry's Mod gamemode that I created for Ascendance Servers, it is a remake of the original Fortwars built for Garry's Mod 12."
  },
  {
    "title": "Garry's Mod: EMSRP",
    "date": "2015-01-02",
    "img": "emsrp.jpg",
    "description": "EMSRP is a Garry's Mod gamemode that I created for the Skynet Community, with the help of their other owner William. It had a range of features such as jobs, shops, door and inventory management, Money and database linking."
  }
]